# Создание таблицы PostgreSQL
import psycopg2
from psycopg2 import Error

try:
    # Подключиться к существующей базе данных
    connection = psycopg2.connect(user="postgres",
                                  # пароль, который указали при установке PostgreSQL
                                  password="141194",
                                  host="127.0.0.1",
                                  port="5432",
                                  database="postgres_db")

    # Создайте курсор для выполнения операций с базой данных
    cursor = connection.cursor()
    # SQL-запрос для создания новой таблицы
    create_table_query = '''create table job_offers
    (
    id                 bigint generated by default as identity
        constraint job_offers_id_pk
            primary key,
    created_at         timestamp default now() not null,
    updated_at         timestamp default now() not null,
    published_at       timestamp               not null,
    raw_text           text,
    reference          varchar,
    processed          boolean   default false,
    title              varchar,
    location           varchar,
    description        varchar,
    position  varchar
    );'''
    # Выполнение команды: это создает новую таблицу
    cursor.execute(create_table_query)
    connection.commit()
    print("Таблица успешно создана в PostgreSQL")

except (Exception, Error) as error:
    print("Ошибка при работе с PostgreSQL", error)
finally:
    if connection:
        cursor.close()
        connection.close()
        print("Соединение с PostgreSQL закрыто")